import { AlertCircle } from "lucide-react"

import {
    Alert,
    AlertDescription,
    AlertTitle,
} from "@/components/ui/alert"

export function Instructions() {
    return (
        <Alert variant="default" className="bg-yellow-200/50 mt-5  line-clamp-6 md:line-clamp-none max-w-[850px]  
        space-y-2  text-yellow-800 dark:text-yellow-200
         border-yellow-400">
            <AlertCircle className="h-4 w-4" />
            <AlertTitle>تعلميات !</AlertTitle>
            <AlertDescription className="text-base">

                1. تجنب استعمال الألفاظ الخارج: يُحسن تجنب استخدام اللغة البذيئة أو الفاظ خارجة خلال الوجبة، فهذا يساهم في خلق جو من الاحترام والمودة بين الحضور.
                <br />
                2. عدم هدر الطعام: من الضروري تجنب إهدار الطعام. قد تحاول تناول كميات مناسبة وتقدير كمية الطعام التي تحتاجها لتجنب إهدار الباقي.
                <br />
                3. الحرص على النظافة: احرص على أن تبقى المنطقة التي تتناول فيها الطعام نظيفة، وتجنب رمي الطعام على الأرض أو ترك بقايا الطعام من دون تنظيف.
                <br />
                4. الاستمتاع بالطعام بدون هوان أو انزعاج: قم بالاستمتاع بوجبتك دون أي ضغوطات أو هوان. استمتع بكل لحظة وتذوق الطعام ببهجة وسرور.
                <br />
                5. الاحترام والتقدير للطعام والطهاة**: قدم احترامك وتقديرك للطعام والطهاة الذين أعدوا الوجبة. قد يكونون قد بذلوا جهداً كبيراً لتقديم الطعام، لذا كن ممتناً واعترف بجهودهم.
                <br />
                6. التحدث بلطف واحترام: تحدث بلطف واحترام مع الآخرين أثناء تناول الطعام. اجعل الجلوس حول المائدة تجربة ممتعة ومفعمة بالإيجابية.
                <br />
                7. عدم التأخير على الآخرين: حاول أن لا تتأخر عن وقت الإفطار المحدد، وإذا كنت تنتظر الآخرين، فكن متسامحًا وصبورًا.
                <br />
                
            </AlertDescription>
        </Alert>
    )
}
